Tekla.Structures.Analysis.AnalysisDecomposedSelfweightLoad
The AnalysisDecomposedSelfweightLoad class contains information of decomposed selfweight loads.

Tekla.Structures.Analysis.AnalysisDecomposedSelfweightLoad._Directions
The directions of the analysis decomposed node load.

Tekla.Structures.Analysis.AnalysisDecomposedSelfweightLoad._Factors
The factor of the analysis decomposed node load.

Tekla.Structures.Analysis.AnalysisDecomposedSelfweightLoad.Directions
The directions of the decomposed selfweight load.

Tekla.Structures.Analysis.AnalysisDecomposedSelfweightLoad.Factors
The factors of the decomposed selfweight load.

Tekla.Structures.Analysis.AnalysisDecomposedSelfweightLoad.Select
Selects an analysis decomposed selfweight load.

Tekla.Structures.Analysis.AnalysisDecomposedSelfweightLoad.SelectInstance
DO NOT USE! For internal usage only!